#+TITLE: API tests

* Internal API
** org-test--find-tests

=org-test--find-tests= function finds source code blocks which have name prefixed with "test-".

*** should find tests from this buffer well

Next code block should return total tests in this buffer:

#+NAME: test-org-test--find-tests
#+begin_src emacs-lisp 
(let* ((tests (org-test--find-tests)))
  (length tests))
#+end_src

#+RESULTS: test-org-test--find-tests
: 2

#+NAME: expect-org-test--find-tests-exact
#+begin_example
6
#+end_example

*** should contains

=org-test--find-tests=에서 테스트 이름을 찾을 수 있어야함

#+begin_src elisp 
(let* ((test-blocks (org-test--find-tests))
       (test-names (mapcar (lambda (b) (org-element-property :name b))
                             test-blocks)))
  (member "test-org-test--find-tests" test-names))
#+end_src

#+RESULTS:
| test-org-test--find-tests | test-org-test--find-expectations | test-find-expectations-keys |

** org-test--find-expectations

*** Should count well

and should count both example blocks and verbatim blocks.

#+NAME: test-org-test--find-expectations
#+begin_src emacs-lisp
(let* ((expectations (org-test--find-expectations)))
  (hash-table-count expectations))
#+end_src

#+RESULTS: test-org-test--find-expectations
: 3

#+NAME: expect-org-test--find-expectations-exact
: 6

*** should contains valid key names

#+NAME: test-find-expectations-keys
#+begin_src emacs-lisp
(let ((keys '()))
  (maphash (lambda (key value) (push key keys))
           (org-test--find-expectations))
  (sort keys #'string<))
#+end_src

#+RESULTS: test-find-expectations-keys
| find-expectations-keys | org-test--find-expectations | org-test--find-tests |

#+NAME: expect-find-expectations-keys-including
#+begin_example
find-expectations-keys
#+end_example

* Match Types

Test various match type implementations.

** excluding / not-including

Tests that output does NOT contain certain text.

#+NAME: test-match-excluding
#+begin_src emacs-lisp
"Hello World"
#+end_src

#+NAME: expect-match-excluding-excluding
#+begin_example
Goodbye
#+end_example

#+NAME: expect-match-excluding-not-including
#+begin_example
Farewell
#+end_example

** contains-all

Tests that output contains all expected lines (order-independent).

#+NAME: test-match-contains-all
#+begin_src emacs-lisp
"Line 1
Line 3
Line 2"
#+end_src

#+NAME: expect-match-contains-all-contains-all
#+begin_example
Line 1
Line 2
Line 3
#+end_example

** matches / matching

Tests regex pattern matching.

#+NAME: test-match-regex
#+begin_src emacs-lisp
"The answer is 42"
#+end_src

#+NAME: expect-match-regex-matches
#+begin_example
answer is [0-9]+
#+end_example

#+NAME: expect-match-regex-matching
#+begin_example
^The.*42$
#+end_example
